def text(inp):
    s = ''
    for i in range(len(inp)):
        k = bin(ord(inp[i])) #получаем двоичный код из исходного текста
        s += k[2:]
        #print(s)
    return s

def main():
    s = input('Введите текст ')
    x = '1' # 'Выберите кодировку:\n 1 - CRC-32 IEE-802.3,\n 2 - CRC-32C,\n 3 - CRC-32K,\n 4 - CRC-32Q\n '
    a = text(s) + '0'*32
    if x == '1':
        b = '100000100110000010001110110110111' #порождающий полином для хэширования CRC-32 IEE-802.3
        b = int(b,2)
    elif x == '2':
        b = '100011110110111000110111101000001' #порождающий полином для хэширования  CRC-32C
        b = int(b,2)
    elif x == '3':
        b = '101110100000110111000110011010111' #порождающий полином для хэширования  CRC-32K
        b = int(b,2)
    elif x == '4':
        b = '110000001010000010100000110101011' #порождающий полином для хэширования  CRC-32Q
        b = int(b,2)
    else: return print('Проверьте корректность ввода')
    c = ''
    while len(a) + len(c) >= 33:
        while len(c) < 33:
            c += a[0]
            a = a[1:]
        xor = int(c,2) ^ b
        c = bin(xor)[2:]
    return c + a
print(main())
