from random import randint

number = 25
a = []
for i in range(10):
    a += [randint(1, 50)]
b = []
for i in range(10):
    if a[i] > number:
        b += ["High"]
    else:
        b += ["Low"]
names = [
    "Адам",
    "Александр",
    "Бенжамин",
    "Вильям",
    "Гарри",
    "Даниэль",
    "Джейк",
    "Джексон",
    "Джереми",
    "Джордан",
    "Исаак",
    "Итан",
    "Анна",
    "Антонелла",
    "Валентина",
    "Джорджия",
    "Джулия",
    "Изабелла",
    "Лена",
    "Лина",
    "Мартина",
    "Миа",
    "Мэдисон",
    "Натали",
    "Оливия",
    "Паула",
    "Руби",
    "Сара",
    "София",
    "Фернанда",
    "Флоренс",
    "Хлоя",
    "Хулия",
    "Шарлотта",
    "Элизабет",
    "Элис",
    "Эмили",
    "Эмма",
    "Кевин",
    "Колин",
    "Конор",
    "Кристиан",
    "Кэмерон",
    "Лео",
    "Макс",
    "Марк",
    "Мухаммед",
    "Мэтью",
    "Натан",
    "Николас",
]
names1 = [i for i in names if i[0]<='К']
names2 = [i for i in names if i[0]>'К']
print(a)
print(b)
# print(names)
print(names1)
print(names2)
# print(len(names), len(names1), len(names2))
